bluekitchen/btstack/port/renesas-tb-s1ja-cc256x/template/btstack_example/synergy/ssp/src/driver/r_flash_lp/r_flash_lp.c
/*LDRA_INSPECTED 219 s - This is an allowed exception to LDRA standard 219 S "User name starts with underscore."*/
static void           flash_operation_complete (flash_lp_instance_ctrl_t * const p_ctrl, ssp_err_t err) PLACE_IN_RAM_SECTION;

/*LDRA_INSPECTED 219 s - This is an allowed exception to LDRA standard 219 S "User name starts with underscore."*/
static ssp_err_t      flash_write_initiate (flash_lp_instance_ctrl_t * const p_ctrl, uint32_t const src_start_address, uint32_t dest_start_address, uint32_t num_bytes) PLACE_IN_RAM_SECTION;

static ssp_err_t      flash_fmi_setup (flash_lp_instance_ctrl_t * const p_ctrl, flash_cfg_t const * const p_cfg, ssp_feature_t *p_ssp);

#if (FLASH_CFG_PARAM_CHECKING_ENABLE == 1)
/*LDRA_INSPECTED 219 s - This is an allowed exception to LDRA standard 219 S "User name starts with underscore."*/
static ssp_err_t      flash_write_parameter_checking (flash_lp_instance_ctrl_t * const p_ctrl, uint32_t flash_address, uint32_t const num_bytes) PLACE_IN_RAM_SECTION;

/*LDRA_INSPECTED 219 s - This is an allowed exception to LDRA standard 219 S "User name starts with underscore."*/
static ssp_err_t      flash_erase_parameter_checking (flash_lp_instance_ctrl_t * const p_ctrl, uint32_t const num_blocks) PLACE_IN_RAM_SECTION;

/*LDRA_INSPECTED 219 s - This is an allowed exception to LDRA standard 219 S "User name starts with underscore."*/
static ssp_err_t      flash_blank_check_parameter_checking (flash_lp_instance_ctrl_t * const p_ctrl, uint32_t const address, uint32_t num_bytes) PLACE_IN_RAM_SECTION;
#endif

/***********************************************************************************************************************
 * Exported global variables
 **********************************************************************************************************************/
/*LDRA_NOANALYSIS LDRA_INSPECTED below not working. */
/*LDRA_INSPECTED 27 D This structure must be accessible in user code. It cannot be static. */
const flash_api_t g_flash_on_flash_lp =
{
    .open                 = R_FLASH_LP_Open,
    .close                = R_FLASH_LP_Close,
    .write                = R_FLASH_LP_Write,
    .read                 = R_FLASH_LP_Read,
    .erase                = R_FLASH_LP_Erase,
    .blankCheck           = R_FLASH_LP_BlankCheck,
    .statusGet            = R_FLASH_LP_StatusGet,
    .infoGet              = R_FLASH_LP_InfoGet,
    .accessWindowSet      = R_FLASH_LP_AccessWindowSet,
    .accessWindowClear    = R_FLASH_LP_AccessWindowClear,
    .idCodeSet            = R_FLASH_LP_IdCodeSet,
    .reset                = R_FLASH_LP_Reset,
    .startupAreaSelect    = R_FLASH_LP_StartUpAreaSelect,
    .updateFlashClockFreq = R_FLASH_LP_UpdateFlashClockFreq,
    .versionGet           = R_FLASH_LP_VersionGet
};
/*LDRA_ANALYSIS */
#if defined(__GNUC__)
/* This structure is affected by warnings from a GCC compiler bug. This pragma suppresses the warnings in this
 * structure only.*/
/*LDRA_INSPECTED 69 S */
#pragma GCC diagnostic ignored "-Wmissing-field-initializers"
#endif
/** Version data structure used by error logger macro. */
static const ssp_version_t g_flash_lp_version =
{
    .api_version_minor  = FLASH_API_VERSION_MINOR,
    .api_version_major  = FLASH_API_VERSION_MAJOR,
    .code_version_major = FLASH_LP_CODE_VERSION_MAJOR,
    .code_version_minor = FLASH_LP_CODE_VERSION_MINOR
};
#if defined(__GNUC__)
/* Restore warning settings for 'missing-field-initializers' to as specified on command line. */
/*LDRA_INSPECTED 69 S */
#pragma GCC diagnostic pop
#endif

/** Name of module used by error logger macro */
#if BSP_CFG_ERROR_LOG != 0
static const char          g_module_name[] = "r_flash_lp";
#endif

static flash_fmi_regions_t g_flash_code_region = {0U};
static flash_fmi_regions_t g_flash_data_region = {0U};

/***********************************************************************************************************************
 * Functions
 **********************************************************************************************************************/

/*******************************************************************************************************************//**
 * @addtogroup FLASH
 * @{
 **********************************************************************************************************************/

/*******************************************************************************************************************//**
 * @brief  Initialize the Low Power flash peripheral. Implements flash_api_t::open.
 *
 * The Open function initializes the Flash. It first copies the FCU firmware to FCURAM
 * and sets the FCU Clock based on the current FCLK frequency. In addition, if Code Flash programming is enabled,
 * the API code responsible for Code Flash programming will be copied to RAM.
 *
 * This function must be called once prior to calling any other FLASH API functions.
 * If a user supplied callback function is supplied, then the Flash Ready interrupt will be configured to
 * call the users callback routine with an Event type describing the source of the interrupt for Data Flash
 * operations.
 * Subsequent to successfully completing this call p_ctrl->opened will be true.
 *
 * @note Providing a callback function in the supplied p_cfg->callback field, automatically configures the
 *       Flash for Data Flash to operate in non-blocking (BGO) mode.
 *
 * Subsequent to a successful Open(), the Flash is ready to process additional Flash commands.
 *
 * @retval SSP_SUCCESS               Initialization was successful and timer has started.
 * @retval SSP_FLASH_ERR_FAILURE     Failed to successfully enter Programming/Erase mode.
 * @retval SSP_ERR_TIMEOUT           Timed out waiting for FCU to be ready.
 * @retval SSP_ERR_ASSERTION         NULL provided for p_ctrl or p_cfg or problem getting FMI info.
 * @retval SSP_ERR_IRQ_BSP_DISABLED  Caller is requesting BGO but the Flash interrupts are not enabled.
 * @retval SSP_ERR_FCLK              FCLK must be a minimum of 4 MHz for Flash operations.
 * @retval SSP_ERR_IN_USE            Flash Open() has already been called.
 * @retval SSP_ERR_HW_LOCKED         Flash module unable to get the Hardware lock for the Flash LP Periperhal.
 * @return                           See @ref Common_Error_Codes or functions called by this function for other possible
 *                                   return codes. This function calls:
 *                                      * fmi_api_t::productFeatureGet
 *                                      * fmi_api_t::eventInfoGet
 *
 **********************************************************************************************************************/
ssp_err_t R_FLASH_LP_Open (flash_ctrl_t * const p_api_ctrl, flash_cfg_t const * const p_cfg)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;
    ssp_feature_t ssp_feature = {{(ssp_ip_t) 0}};

    /* g_flash_lp_version is accessed by the ASSERT macro only, and so compiler toolchain can issue a
     *  warning that it is not accessed. The code below eliminates this warning and also ensures data
     *  structures are not optimized away. */
    SSP_PARAMETER_NOT_USED(g_flash_lp_version);

