bluekitchen/btstack/port/renesas-tb-s1ja-cc256x/template/btstack_example/synergy/ssp/src/driver/r_flash_lp/r_flash_lp.c
    ssp_err_t err = SSP_SUCCESS;

    /** If null pointers return error. */
#if (FLASH_CFG_PARAM_CHECKING_ENABLE)
    SSP_ASSERT(NULL != p_cfg);
    SSP_ASSERT(NULL != p_ctrl);
#endif

    /** If open return error. */
    FLASH_ERROR_RETURN((FLASH_OPEN != p_ctrl->opened), SSP_ERR_IN_USE);

    /** Setup flash FMI. If failure return error. */
    err = flash_fmi_setup(p_ctrl, p_cfg, &ssp_feature);
    FLASH_ERROR_RETURN((err == SSP_SUCCESS), err);

    /** Allow Initialization if not initialized or if no operation is ongoing and re-initialization is desired */
    if ((FLASH_STATE_UNINITIALIZED == g_flash_state) || (FLASH_STATE_READY == g_flash_state))
    {
        /** Acquire the software lock. If failure return error. */
        FLASH_ERROR_RETURN(!(SSP_SUCCESS != flash_lock_state(FLASH_STATE_INITIALIZATION)), SSP_ERR_IN_USE);
    }

    /** Set the parameters struct based on the user supplied settings */
    g_current_parameters.bgo_enabled_df = p_cfg->data_flash_bgo;

    if (g_current_parameters.bgo_enabled_df == true)
    {
        /** Setup the Flash interrupt callback based on the caller's info. If the Flash interrupt is
         * not enabled in the BSP then this will return SSP_ERR_IRQ_BSP_DISABLED */
       err =  HW_FLASH_LP_irq_cfg((bool) (p_cfg->p_callback != NULL), p_cfg, p_ctrl->irq);
    }
    else
    {
        /** Make sure Flash interrupts are disabled, they are only used in BGO mode */
        HW_FLASH_LP_irq_cfg(false, p_cfg, p_ctrl->irq);
    }

    /** Setup the flash. */
    err = flash_open_setup(p_ctrl, &ssp_feature);

    /** Save callback function pointer  */
    p_ctrl->p_callback = p_cfg->p_callback;

    return err;
}

/*******************************************************************************************************************//**
 * @brief  Write to the specified Code or Data Flash memory area. Implements flash_api_t::write.
 *
 * The minimum/maximum number of bytes, as well as the invalid address and programming boundaries supported and
 * enforced by this function are dependent on the MCU in use as well as the part package size.
 * Please see the User manual and/or requirements document for additional information.
 *
 * @retval SSP_SUCCESS              Operation successful. If BGO is enabled this means the operation was started
 *                                  successfully.
 * @retval SSP_ERR_IN_USE           The Flash peripheral is busy with a prior on-going transaction.
 * @retval SSP_ERR_NOT_OPEN         The Flash API is not Open.
 * @retval SSP_ERR_CMD_LOCKED       FCU is in locked state, typically as a result of attempting to Write
 *                                  an area that is protected by an Access Window.
 * @retval SSP_ERR_WRITE_FAILED     Status is indicating a Programming error for the requested operation. This
 *                                  may be returned if the requested Flash area is not blank.
 * @retval SSP_ERR_TIMEOUT          Timed out waiting for FCU operation to complete.
 * @retval SSP_ERR_INVALID_SIZE     Number of bytes provided was not a multiple of the programming size or exceeded
 *                                  the maximum range.
 * @retval SSP_ERR_INVALID_ADDRESS  Invalid address was input or address not on programming boundary.
 * @retval SSP_ERR_ASSERTION        NULL provided for p_ctrl.
 * @retval SSP_ERR_INVALID_ARGUMENT Code Flash Programming is not enabled and a request to write CF was requested.
**********************************************************************************************************************/
ssp_err_t R_FLASH_LP_Write (flash_ctrl_t * const p_api_ctrl,
                            uint32_t const       src_address,
                            uint32_t             flash_address,
                            uint32_t const       num_bytes)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;
    ssp_err_t err = SSP_SUCCESS;

    /** Get the block information for this address. If failure return error. */
    FLASH_ERROR_RETURN((flash_get_block_info(flash_address, &g_block_info)), SSP_ERR_INVALID_ADDRESS);

#if (FLASH_CFG_PARAM_CHECKING_ENABLE == 1)
    /** Check parameters. If failure return error */
    err = flash_write_parameter_checking (p_ctrl, flash_address, num_bytes);
    FLASH_ERROR_RETURN((err == SSP_SUCCESS), err);

    /** If control block is not open return error. */
    FLASH_ERROR_RETURN((FLASH_OPEN == p_ctrl->opened), SSP_ERR_NOT_OPEN);
#endif /* if (FLASH_CFG_PARAM_CHECKING_ENABLE == 1) */

    /** Initiate the write operation. */
    err = flash_write_initiate(p_ctrl, src_address, flash_address, num_bytes);

    /* Complete the flash operation. */
    flash_operation_complete (p_ctrl, err);

    /** Return status. */
    return err;
}

/*******************************************************************************************************************//**
 * @brief  Read the requested number of bytes from the supplied Data or Code Flash address. Implements flash_api_t::read.
 *
 * The minimum/maximum number of blocks, as well as the invalid address and programming boundaries supported and
 * enforced by this function are dependent on the MCU in use as well as the part package size.
 * Please see the User manual and/or requirements document for additional information.
 *         @note This function is provided simply for the purposes of maintaining a complete interface.
 *         It is possible (and recommended), to read Flash memory directly.
 *
 * @retval SSP_SUCCESS              Operation successful.
 * @retval SSP_ERR_INVALID_ADDRESS  Invalid Flash address was supplied.
 * @retval SSP_ERR_ASSERTION        NULL provided for p_ctrl or p_dest_address
 * @retval SSP_ERR_NOT_OPEN         Flash API has not yet been opened.
 **********************************************************************************************************************/
ssp_err_t R_FLASH_LP_Read  (flash_ctrl_t * const p_api_ctrl, uint8_t * p_dest_address, uint32_t const flash_address,
                            uint32_t const num_bytes)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;

