bluekitchen/btstack/port/renesas-tb-s1ja-cc256x/template/btstack_example/synergy/ssp/src/driver/r_flash_lp/r_flash_lp.c
    /* Eliminate warning if parameter checking is disabled. */
    SSP_PARAMETER_NOT_USED(p_ctrl);

    ssp_err_t err           = SSP_SUCCESS;
    uint32_t  index;
    uint8_t   * p_flash_ptr = (uint8_t *) flash_address;

#if (FLASH_CFG_PARAM_CHECKING_ENABLE == 1)
    /** If null pointers return error */
    SSP_ASSERT(NULL != p_dest_address);
    SSP_ASSERT(NULL != p_ctrl);

    /** If invalid number of bytes return error. */
    FLASH_ERROR_RETURN((0 != num_bytes), SSP_ERR_INVALID_SIZE);

    /** If not open return error */
    FLASH_ERROR_RETURN(!(FLASH_OPEN != p_ctrl->opened), SSP_ERR_NOT_OPEN);

    /** Get the block information for this address. If failure return error. */
    FLASH_ERROR_RETURN((flash_get_block_info(flash_address, &g_block_info)), SSP_ERR_INVALID_ADDRESS);

    /** Insure the read request doesn't span across the end of the CF or DF range. If it does return error. */
    FLASH_ERROR_RETURN(((flash_address + (num_bytes - 1U)) <= g_block_info.memory_end_addr), SSP_ERR_INVALID_ADDRESS);
#endif /* if (FLASH_CFG_PARAM_CHECKING_ENABLE == 1) */

    /** Copy the data to the destination buffer. */
    for (index = (uint32_t)0; index < num_bytes; index++)
    {
        p_dest_address[index] = p_flash_ptr[index];
    }

    return err;
}

/*******************************************************************************************************************//**
 * @brief  Erase the specified Code or Data Flash blocks. Implements flash_api_t::erase.
 *
 * The minimum/maximum number of blocks, as well as the invalid address and programming boundaries supported and
 * enforced by this function are dependent on the MCU in use as well as the part package size.
 * Please see the User manual and/or requirements document for additional information.
 * @retval SSP_SUCCESS                 Successful open.
 * @retval SSP_ERR_INVALID_BLOCKS      Invalid number of blocks specified
 * @retval SSP_ERR_INVALID_ADDRESS     Invalid address specified
 * @retval SSP_ERR_IN_USE              Other flash operation in progress, or API not initialized
 * @retval SSP_ERR_CMD_LOCKED          FCU is in locked state, typically as a result of attempting to Erase
 *                                     an area that is protected by an Access Window.
 * @retval SSP_ERR_ASSERTION           NULL provided for p_ctrl
 * @retval SSP_ERR_NOT_OPEN            The Flash API is not Open.
 * @retval SSP_ERR_INVALID_ARGUMENT    Code Flash Programming is not enabled and a request to erase CF was requested.
 **********************************************************************************************************************/
ssp_err_t R_FLASH_LP_Erase (flash_ctrl_t * const p_api_ctrl, uint32_t const address, uint32_t const num_blocks)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;

    ssp_err_t err = SSP_SUCCESS;

    /** Get the block information for this address. If failure return error. */
    FLASH_ERROR_RETURN((flash_get_block_info(address, &g_block_info)), SSP_ERR_INVALID_ADDRESS);

#if (FLASH_CFG_PARAM_CHECKING_ENABLE == 1)
    /** Verify erase parameters. If failure return error. */
    err = flash_erase_parameter_checking (p_ctrl, num_blocks);
    FLASH_ERROR_RETURN((err == SSP_SUCCESS), err);
#endif /* if (FLASH_CFG_PARAM_CHECKING_ENABLE == 1) */

    /** Update Flash state and enter the respective Code or Data Flash P/E mode, may return SSP_ERR_IN_USE */
    err = setup_for_pe_mode(p_ctrl, g_block_info.flash_type, FLASH_STATE_ERASING);

    /** If successful */
    if (SSP_SUCCESS == err)
    {
        /** Configure the current parameters based on if the operation is for code flash or data flash. */
        if (g_block_info.is_code_flash_addr == true)
        {
            g_current_parameters.wait_cnt          = g_current_parameters.wait_max_erase_cf_block;
            g_current_parameters.current_operation = FLASH_OPERATION_CF_ERASE;
        }
        else
        {
            g_current_parameters.wait_cnt = g_current_parameters.wait_max_erase_df_block;
            /** If this is a request to erase Data Flash configure BGO mode if it is enabled. */
            if (g_current_parameters.bgo_enabled_df == false)
            {
                g_current_parameters.current_operation = FLASH_OPERATION_DF_ERASE;
            }
            else
            {
                g_current_parameters.current_operation = FLASH_OPERATION_DF_BGO_ERASE;
            }
        }

        /** Initiate the flash erase. */
        err = HW_FLASH_LP_erase(p_ctrl, g_block_info.this_block_st_addr, num_blocks, g_block_info.block_size);
        if (SSP_SUCCESS == err)
        {
            /** If in non-BGO mode, the current operation is complete. Exit PE mode and return status*/
            if (g_current_parameters.current_operation != FLASH_OPERATION_DF_BGO_ERASE)
            {
                err = HW_FLASH_LP_pe_mode_exit(p_ctrl);
            }
        }
    }

    /** Complete the flash operation. */
    /* Execute a reset if any error, release the state if not BGO */
    flash_operation_complete (p_ctrl, err);

    return err;
}

/*******************************************************************************************************************//**
 * @brief  Perform a blank check on the specified address area. Implements flash_api_t::blankCheck.
 *
 * The minimum/maximum number of bytes, as well as the invalid address and programming boundaries supported and
 * enforced by this function are dependent on the MCU in use as well as the part package size.
 * Please see the User manual and/or requirements document for additional information.
 * The number of bytes for Data Flash blank checking must be between (1 and FLASH_DATA_BLANK_CHECK_MAX).
 * The number of bytes for Code Flash blank checking must be between (1 and FLASH_CODE_BLANK_CHECK_MAX).
 *
 * @retval SSP_SUCCESS              Blankcheck operation completed with result in p_blank_check_result,
 *                                  or blankcheck started and in-progess (BGO mode).
 * @retval SSP_ERR_INVALID_ADDRESS  Invalid data flash address was input
 * @retval SSP_ERR_INVALID_SIZE     'num_bytes' was either too large or not aligned for the CF/DF boundary size.
 * @retval SSP_ERR_IN_USE           Flash is busy with an on-going operation.
 * @retval SSP_ERR_ASSERTION        NULL provided for p_ctrl
 * @retval SSP_ERR_NOT_OPEN         Flash API has not yet been opened.
 * @retval SSP_ERR_INVALID_ARGUMENT Code Flash Programming is not enabled and a request to Blank Check CF was requested.
 **********************************************************************************************************************/
ssp_err_t R_FLASH_LP_BlankCheck (flash_ctrl_t * const p_api_ctrl, uint32_t const address, uint32_t num_bytes,
                                 flash_result_t * p_blank_check_result)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;
    ssp_err_t err         = SSP_SUCCESS;


