bluekitchen/btstack/port/renesas-tb-s1ja-cc256x/template/btstack_example/synergy/ssp/src/driver/r_flash_lp/r_flash_lp.c
    /** Get the block information for this address. If failure return error. */
    FLASH_ERROR_RETURN((flash_get_block_info(address, &g_block_info)), SSP_ERR_INVALID_ADDRESS);

#if (FLASH_CFG_PARAM_CHECKING_ENABLE == 1)
    err = flash_blank_check_parameter_checking (p_ctrl, address, num_bytes);
    FLASH_ERROR_RETURN((err == SSP_SUCCESS), err);
#endif /* if (FLASH_CFG_PARAM_CHECKING_ENABLE == 1) */


    /** Update Flash state and enter the respective Code or Data Flash P/E mode, may return SSP_ERR_IN_USE */
    err = setup_for_pe_mode(p_ctrl, g_block_info.flash_type, FLASH_STATE_BLANK_CHECK);
    if (SSP_SUCCESS == err)
    {
        /** Initiate the Blank Check operation */
        err = flash_blank_check_initiate(p_ctrl, address, num_bytes, p_blank_check_result);
    }

    /** If failure reset the flash. */
    /* SSP_ERR_IN_USE would indicate that a BGO operation is underway, so don't reset in that case */
    if ((SSP_SUCCESS != err) && (SSP_ERR_IN_USE != err))
    {
        /* This will clear error flags and exit the P/E mode*/
        HW_FLASH_LP_reset(p_ctrl);
    }

    /** If the current operation is not a BGO blank check release the flash. */
    if (g_current_parameters.current_operation != FLASH_OPERATION_DF_BGO_BLANKCHECK)
    {
        flash_ReleaseState();
    }

    return err;
}

/*******************************************************************************************************************//**
 * @brief  Query the FLASH for its status. Implements flash_api_t::statusGet.
 *
 * @retval SSP_SUCCESS              Flash is ready and available to accept commands.
 * @retval SSP_ERR_IN_USE           Flash is busy with an on-going operation.
 * @retval SSP_ERR_ASSERTION        NULL provided for p_ctrl
 * @retval SSP_ERR_NOT_OPEN         Flash API has not yet been opened.
 **********************************************************************************************************************/
ssp_err_t R_FLASH_LP_StatusGet (flash_ctrl_t * const p_api_ctrl)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;

    /* Eliminate warning if parameter checking is disabled. */
    SSP_PARAMETER_NOT_USED(p_ctrl);

#if (FLASH_CFG_PARAM_CHECKING_ENABLE == 1)
    /** If null pointer return error. */
    SSP_ASSERT(NULL != p_ctrl);

    /** If not opern return error. */
    FLASH_ERROR_RETURN(!(FLASH_OPEN != p_ctrl->opened), SSP_ERR_NOT_OPEN);
#endif

    /** Return flash status */
    if (g_flash_state == FLASH_STATE_READY)
    {
        return SSP_SUCCESS;
    }
    else
    {
        return SSP_ERR_IN_USE;
    }

}

/*******************************************************************************************************************//**
 * @brief  Configure an access window for the Code Flash memory. Implements flash_api_t::accessWindowSet.
 *
 * An access window defines a contiguous area in Code Flash for which programming/erase is enabled.
 * This area is on block boundaries.
 * The block containing start_addr is the first block. The block containing end_addr is the last block.
 * The access window then becomes first block --> last block inclusive. Anything outside this range
 * of Code Flash is then write protected.
 * As an example, if you wanted to place an accesswindow on Code Flash Blocks 0 and 1, such that
 * only those two blocks were writable, you would need to specify (address in block 0, address in block 2)
 * as the respective start and end address.
 * @note If the start address and end address are set to the same value, then the access window
 * is effectively removed. This accomplishes the same functionality as R_FLASH_LP_AccessWindowClear().
 *
 * The invalid address and programming boundaries supported and enforced by this function are dependent on the MCU
 * in use as well as the part package size. Please see the User manual and/or requirements document
 * for additional information.
 *
 * @retval SSP_SUCCESS                Access window successfully configured.
 * @retval SSP_ERR_INVALID_ADDRESS    Invalid settings for start_addr and/or end_addr.
 * @retval SSP_ERR_IN_USE             FLASH peripheral is busy with a prior operation.
 * @retval SSP_ERR_ASSERTION          NULL provided for p_ctrl.
 * @retval SSP_ERR_INVALID_ARGUMENT   Code Flash Programming is not enabled.
 * @retval SSP_ERR_NOT_OPEN           Flash API has not yet been opened.
 **********************************************************************************************************************/
ssp_err_t R_FLASH_LP_AccessWindowSet (flash_ctrl_t * const p_api_ctrl, uint32_t const start_addr,
                                      uint32_t const end_addr)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;

    /* Eliminate warning if parameter checking is disabled. */
    SSP_PARAMETER_NOT_USED(p_ctrl);
    SSP_PARAMETER_NOT_USED(start_addr);      // Remove warnings generated when Code Flash code is not compiled in.
    SSP_PARAMETER_NOT_USED(end_addr);

    ssp_err_t err = SSP_SUCCESS;

#if (FLASH_CFG_PARAM_CODE_FLASH_PROGRAMMING_ENABLE == 1)
#if (FLASH_CFG_PARAM_CHECKING_ENABLE)
    /** If null pointer return error. */
    SSP_ASSERT(NULL != p_ctrl);

    /** If not open return error. */
    FLASH_ERROR_RETURN(!(FLASH_OPEN != p_ctrl->opened), SSP_ERR_NOT_OPEN);
#endif

    uint32_t last_cf_block_index = g_flash_code_region.num_regions - 1U;
    uint32_t cf_st_addr = g_flash_code_region.p_block_array[0].block_section_st_addr;
    uint32_t cf_end_addr = g_flash_code_region.p_block_array[last_cf_block_index].block_section_end_addr;

    /* Note that the end_addr indicates the address up to, but not including the block that contains that address. */
    /* Therefore to allow the very last Block to be included in the access window we must allow for FLASH_CF_BLOCK_END+1 */
    /** If the start or end addresses are invalid return error. */
    if ((start_addr >= cf_st_addr) && (end_addr <= (cf_end_addr + 1)) &&  (start_addr <= end_addr))
    {
        /** Update Flash state and enter Code Flash P/E mode */
        err = setup_for_pe_mode(p_ctrl, FLASH_TYPE_CODE_FLASH, FLASH_STATE_ACCESS_WINDOW);

        /** If successful */
        if (SSP_SUCCESS == err)
        {
            /** Set the access window. */
            err = HW_FLASH_LP_access_window_set(p_ctrl, start_addr, end_addr);

            if (SSP_SUCCESS == err)
            {
                /** Return to read mode */
                err = HW_FLASH_LP_pe_mode_exit(p_ctrl);
            }
        }

