bluekitchen/btstack/port/renesas-tb-s1ja-cc256x/template/btstack_example/synergy/ssp/src/driver/r_flash_lp/r_flash_lp.c
        if (SSP_SUCCESS != err)
        {
            /** If there is an error, then reset the Flash. This will clear error flags and exit the P/E mode */
            HW_FLASH_LP_reset(p_ctrl);
        }

        /** Release the flash. */
        flash_ReleaseState();
    }
    else
    {
        err = SSP_ERR_INVALID_ADDRESS;
    }

#else
    /** If not code flash return error. */
    err = SSP_ERR_INVALID_ARGUMENT;     // For consistency with _LP API we return error if Code Flash not enabled
#endif
    return err;
}

/*******************************************************************************************************************//**
 * @brief  Remove any access window that is configured in the Code Flash. Implements flash_api_t::accessWindowClear.
 *         On successful return from this call all Code Flash is writable.
 *
 * @retval SSP_SUCCESS          Access window successfully removed.
 * @retval SSP_ERR_IN_USE       FLASH peripheral is busy with a prior operation.
 * @retval SSP_ERR_ASSERTION    NULL provided for p_ctrl.
 * @retval SSP_ERR_INVALID_ARGUMENT Code Flash Programming is not enabled.
 * @retval SSP_ERR_NOT_OPEN        Flash API has not yet been opened.
 **********************************************************************************************************************/
ssp_err_t R_FLASH_LP_AccessWindowClear (flash_ctrl_t * const p_api_ctrl)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;

    /* Eliminate warning if parameter checking is disabled. */
    SSP_PARAMETER_NOT_USED(p_ctrl);
    ssp_err_t err = SSP_SUCCESS;

#if (FLASH_CFG_PARAM_CODE_FLASH_PROGRAMMING_ENABLE == 1)
#if (FLASH_CFG_PARAM_CHECKING_ENABLE)
    /** If null pointer return error. */
    SSP_ASSERT(NULL != p_ctrl);

    /** If not open return error. */
    FLASH_ERROR_RETURN(!(FLASH_OPEN != p_ctrl->opened), SSP_ERR_NOT_OPEN);

    /** If operation in progress return error. */
    err = R_FLASH_LP_StatusGet(p_ctrl);
    FLASH_ERROR_RETURN((err == SSP_SUCCESS), err);
#endif

    /** Update Flash state and enter Code Flash P/E mode */
    err = setup_for_pe_mode(p_ctrl, FLASH_TYPE_CODE_FLASH, FLASH_STATE_ACCESS_WINDOW);

    /** If successful clear the access window. */
    if (SSP_SUCCESS == err)
    {
        err = HW_FLASH_LP_access_window_clear(p_ctrl);

        /** If successful return to read mode. */
        if (SSP_SUCCESS == err)
        {
            err = HW_FLASH_LP_pe_mode_exit(p_ctrl);
        }
    }

    /** If failure reset the flash. */
    if (SSP_SUCCESS != err)
    {
        /* If there is an error, then reset the Flash. This will clear error flags and exit the P/E mode */
        HW_FLASH_LP_reset(p_ctrl);
    }

    /** Release the flash. */
    flash_ReleaseState();
#else
    err = SSP_ERR_INVALID_ARGUMENT;     ///< Return error if Code Flash not enabled
#endif

    return err;
}

/*******************************************************************************************************************//**
 * @brief      Write the ID code provided to the id code registers. Implements flash_api_t::idCodeSet.
 *
 * @retval     SSP_SUCCESS               ID code successfully configured.
 * @retval     SSP_ERR_IN_USE            FLASH peripheral is busy with a prior operation.
 * @retval     SSP_ERR_ASSERTION         NULL provided for p_ctrl.
 * @retval     SSP_ERR_INVALID_ARGUMENT  Code Flash Programming is not enabled.
 * @retval     SSP_ERR_NOT_OPEN          Flash API has not yet been opened.
 * @retval     SSP_ERR_WRITE_FAILED      Status is indicating a Programming error for the requested operation.
 * @retval     SSP_ERR_TIMEOUT           Timed out waiting for completion of extra command.
 **********************************************************************************************************************/
ssp_err_t R_FLASH_LP_IdCodeSet (flash_ctrl_t               * const p_api_ctrl, 
                                uint8_t              const * const p_id_code, 
                                flash_id_code_mode_t               mode)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;

    ssp_err_t err = SSP_SUCCESS;

#if (FLASH_CFG_PARAM_CODE_FLASH_PROGRAMMING_ENABLE == 1)
#if (FLASH_CFG_PARAM_CHECKING_ENABLE)
    /** If null pointer return error. */
    SSP_ASSERT(NULL != p_ctrl);
    SSP_ASSERT(NULL != p_id_code);

    /** If control block is not open return error. */
    FLASH_ERROR_RETURN(!(FLASH_OPEN != p_ctrl->opened), SSP_ERR_NOT_OPEN);
#endif
    /** Update Flash state and enter Code Flash P/E mode */
    err = setup_for_pe_mode(p_ctrl, FLASH_TYPE_CODE_FLASH, FLASH_STATE_ID_CODE);

    /** If successful set the id code. */
    if (SSP_SUCCESS == err)
    {
        err = HW_FLASH_LP_set_id_code(p_ctrl, p_id_code, mode);
    }

    /** If successful return to read mode. Otherwise reset the flash. */
    if (SSP_SUCCESS == err)
    {
        /* Return to read mode*/
        err = HW_FLASH_LP_pe_mode_exit(p_ctrl);
    }
    else
    {
        /* If there is an error, then reset the FCU: This will clear error flags and exit the P/E mode*/
        HW_FLASH_LP_reset(p_ctrl);
    }

    /** Release the flash. */
    flash_ReleaseState();

#else
    /* Eliminate warning if code flash programming is disabled. */
    SSP_PARAMETER_NOT_USED(p_ctrl);
    SSP_PARAMETER_NOT_USED(p_id_code);
    SSP_PARAMETER_NOT_USED(mode);

    err = SSP_ERR_INVALID_ARGUMENT;     // For consistency with _LP API we return error if Code Flash not enabled
#endif
    /** Return status. */
    return err;
}

/*******************************************************************************************************************//**
 * @brief  Reset the FLASH peripheral. Implements flash_api_t::reset.
 *
 * No attempt is made to grab the Flash software lock before executing the reset since the assumption is that a reset
 * will terminate any existing operation.
 *
 * @retval SSP_SUCCESS        Flash circuit successfully reset.
 * @retval SSP_ERR_ASSERTION  NULL provided for p_ctrl
 * @retval SSP_ERR_NOT_OPEN   Flash API has not yet been opened.
 **********************************************************************************************************************/
ssp_err_t R_FLASH_LP_Reset (flash_ctrl_t * const p_api_ctrl)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;

