bluekitchen/btstack/port/renesas-tb-s1ja-cc256x/template/btstack_example/synergy/ssp/src/driver/r_flash_lp/r_flash_lp.c
    ssp_err_t err = SSP_SUCCESS;

#if (FLASH_CFG_PARAM_CHECKING_ENABLE)
    /** If null pointer return error. */
    SSP_ASSERT(NULL != p_ctrl);

    /** If not open return error */
    FLASH_ERROR_RETURN(!(FLASH_OPEN != p_ctrl->opened), SSP_ERR_NOT_OPEN);
#endif

    /** Reset the flash. */
    HW_FLASH_LP_reset(p_ctrl);

    /** Release the flash. */
    flash_ReleaseState();

    return err;
}

/******************************************************************************************************************//**
 * @brief  Select which block is used as the startup area block. Implements flash_api_t::startupAreaSelect.
 *
 *         Selects which block - Default (Block 0) or Alternate (Block 1) is used as the startup area block.
 *         The provided parameters determine which block will become the active startup block and whether that
 *         action will be immediate (but temporary), or permanent subsequent to the next reset.
 *         Doing a temporary switch might appear to have limited usefulness. If there is an access window
 *         in place such that Block 0 is write protected, then one could do a temporary switch, update the
 *         block and switch them back without having to touch the access window.
 *
 * @retval SSP_SUCCESS              Start-up area successfully toggled.
 * @retval SSP_ERR_IN_USE           Flash is busy with an on-going operation.
 * @retval SSP_ERR_ASSERTION        NULL provided for p_ctrl
 * @retval SSP_ERR_NOT_OPEN         Flash API has not yet been opened.
 **********************************************************************************************************************/
ssp_err_t R_FLASH_LP_StartUpAreaSelect (flash_ctrl_t * const      p_api_ctrl,
                                        flash_startup_area_swap_t swap_type,
                                        bool                      is_temporary)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;

    ssp_err_t err = SSP_SUCCESS;

#if (FLASH_CFG_PARAM_CHECKING_ENABLE)
    /** If null pointer return error. */
    SSP_ASSERT(NULL != p_ctrl);

    /** If not open return error. */
    FLASH_ERROR_RETURN((FLASH_OPEN == p_ctrl->opened), SSP_ERR_NOT_OPEN);
#endif

    /** If the swap type is BTFLG and the operation is temporary there's nothing to do. Return success. */
    if ((swap_type == FLASH_STARTUP_AREA_BTFLG) && (is_temporary == false))
    {
        return err;
    }

    /** Update Flash state and enter the respective Code or Data Flash P/E mode. */
    err = setup_for_pe_mode(p_ctrl, FLASH_TYPE_CODE_FLASH, FLASH_STATE_STARTUP_AREA);

    /** If successful call the temporary or boot startup area set functions depending on the users flag. */
    if (err == SSP_SUCCESS)
    {
        if (is_temporary == true)
        {
            err = HW_FLASH_LP_set_startup_area_temporary(p_ctrl, swap_type);
        }
        else
        {
            err = HW_FLASH_LP_set_startup_area_boot(p_ctrl, swap_type);
        }
    }

    /** If successful return to read mode otherwise reset the flash. */
    if (SSP_SUCCESS == err)
    {
        err = HW_FLASH_LP_pe_mode_exit(p_ctrl);
    }
    else
    {
        /* If there is an error, then reset the Flash. This will clear error flags and exit the P/E mode */
        HW_FLASH_LP_reset(p_ctrl);
    }

    /** Release the flash. */
    flash_ReleaseState();
    return err;
}


/******************************************************************************************************************//**
 * @brief  Indicate to the already open Flash API that the FCLK has changed. Implements r_flash_t::updateFlashClockFreq.
 *
 * This could be the case if the application has changed the system clock, and therefore the FCLK.
 * Failure to call this function subsequent to changing the FCLK could result in damage to the flash macro.
 * This function uses R_CGC_SystemClockFreqGet() to get the current FCLK frequency.
 *
 *
 * @retval SSP_SUCCESS              Start-up area successfully toggled.
 * @retval SSP_ERR_IN_USE           Flash is busy with an on-going operation.
 * @retval SSP_ERR_ASSERTION        NULL provided for p_ctrl
 * @retval SSP_ERR_NOT_OPEN         Flash API has not yet been opened.
 **********************************************************************************************************************/
ssp_err_t R_FLASH_LP_UpdateFlashClockFreq (flash_ctrl_t * const  p_api_ctrl)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;

    ssp_err_t err = SSP_SUCCESS;

#if (FLASH_CFG_PARAM_CHECKING_ENABLE)
    /** If null pointer return error. */
    SSP_ASSERT(NULL != p_ctrl);

    /** If the flash api is not open return an error. */
    FLASH_ERROR_RETURN(FLASH_OPEN == p_ctrl->opened, SSP_ERR_NOT_OPEN);
#endif

    /** Lock the flash state. If failure return error. */
    FLASH_ERROR_RETURN(SSP_SUCCESS == flash_lock_state(FLASH_UPDATE_FCLK), SSP_ERR_IN_USE);

    /** Setup the Flash. */
    err = flash_setup(p_ctrl);    // Check FCLK, calculate timeout values

    /** Release the flash. */
    flash_ReleaseState();

    return err;
}
/*******************************************************************************************************************//**
 * @brief      Returns the information about the flash regions. Implements
 *             flash_api_t::infoGet.
 *
 * @retval     SSP_SUCCESS       Successful retrieved the request information.
 * @retval SSP_ERR_ASSERTION     NULL provided for p_ctrl or p_info.
 **********************************************************************************************************************/
ssp_err_t R_FLASH_LP_InfoGet (flash_ctrl_t * const      p_api_ctrl, flash_info_t  * const p_info)
{
#if FLASH_CFG_PARAM_CHECKING_ENABLE
    /** If null pointers return error. */
    SSP_ASSERT(NULL != p_api_ctrl);
    SSP_ASSERT(NULL != p_info);
#endif

    /** Copy the region data to the info structure. */
    p_info->code_flash = g_flash_code_region;
    p_info->data_flash = g_flash_data_region;

