bluekitchen/btstack/port/renesas-tb-s1ja-cc256x/template/btstack_example/synergy/ssp/src/driver/r_flash_lp/r_flash_lp.c
    return SSP_SUCCESS;
}
/*******************************************************************************************************************//**
 * @brief      Release any resources that were allocated by the Flash API. Implements flash_api_t::close.
 *
 * @retval SSP_SUCCESS           Successful close.
 * @retval SSP_ERR_ASSERTION     NULL provided for p_ctrl or p_cfg.
 **********************************************************************************************************************/
ssp_err_t R_FLASH_LP_Close (flash_ctrl_t * const p_api_ctrl)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;

    /* Eliminate warning if parameter checking is disabled. */
    SSP_PARAMETER_NOT_USED(p_ctrl);

    ssp_err_t err = SSP_SUCCESS;

#if FLASH_CFG_PARAM_CHECKING_ENABLE
    /** If null pointer return error. */
    SSP_ASSERT(NULL != p_ctrl);
#endif

    ssp_feature_t ssp_feature = {{(ssp_ip_t) 0U}};
    ssp_feature.channel = 0U;
    ssp_feature.unit = 0U;
    ssp_feature.id = SSP_IP_FCU;

    /** Unlock the flash hardware. */
    R_BSP_HardwareUnlock(&ssp_feature);

    /** Disable the flash interrupt. */
    HW_FLASH_LP_irq_cfg(false, NULL, p_ctrl->irq);

    /** Mark the control block as closed. */
    p_ctrl->opened = false;

    /** Release the lock */
    flash_ReleaseState();

    return err;
}

/*******************************************************************************************************************//**
 * @brief   Get FLASH HAL driver version.
 *
 * @retval  SSP_SUCCESS - operation performed successfully
 * @note This function is reentrant.
 **********************************************************************************************************************/
ssp_err_t R_FLASH_LP_VersionGet (ssp_version_t * const p_version)
{
#if FLASH_CFG_PARAM_CHECKING_ENABLE
    /** If null pointer return error. */
    SSP_ASSERT(NULL != p_version);
#endif

    /** Return the version id of the flash lp module. */
    p_version->version_id = g_flash_lp_version.version_id;
    return SSP_SUCCESS;
}  /* End of function R_FLASH_LP_VersionGet() */

/*******************************************************************************************************************//**
 * @} (end addtogroup FLASH)
 **********************************************************************************************************************/

/*******************************************************************************************************************//**
 * @brief   This function attempts to change the flash state to the new requested state.
 *          This can only happen if we are able to take the FLASH lock. If the lock is currently in use then
 *          we will return FLASH_ERR_BUSY, otherwise we will take the lock and change the state.
 *
 * @param[in]  new_state        Which state to attempt to transition to.
 * @retval SSP_SUCCESS      Successful.
 * @retval SSP_ERR_IN_USE   Flash is busy with an on-going operation.
 **********************************************************************************************************************/
static ssp_err_t flash_lock_state (flash_states_t new_state)
{
    /** Check to see if lock was successfully taken */
    if (R_BSP_SoftwareLock(&g_flash_Lock) == SSP_SUCCESS)
    {
        /** Lock taken, we can change state */
        g_flash_state = new_state;

        /** Return success */
        return SSP_SUCCESS;
    }
    else
    {
        /** Another operation is on-going */
        return SSP_ERR_IN_USE;
    }
}

/*******************************************************************************************************************//**
 * @brief   This function releases the flash state so another flash operation can take place.
 *          This function is called by both the HLD and LLD layers (interrupt routines).
 *
 * @retval None
 **********************************************************************************************************************/
void flash_ReleaseState (void)
{
    /** Done with current operation */
    g_flash_state = FLASH_STATE_READY;

    /** Release hold on lock */
    R_BSP_SoftwareUnlock(&g_flash_Lock);
}

/*******************************************************************************************************************//**
 * @brief   This function places the flash in the requested Code or Data P/E mode.
 *
 * @param[in]   flash_type          FLASH_TYPE_CODE_FLASH or FLASH_TYPE_DATA_FLASH.
 * @param[in]   p_ctrl              Control Instance
 * @param[in]   flash_state         Desired Flash state to transition into (ie FLASH_STATE_WRITING).
 * @retval SSP_SUCCESS              Successful.
 * @retval SSP_ERR_INVALID_ARGUMENT Supplied flash_type was something other than FLASH_TYPE_CODE_FLASH or
 *                                  FLASH_TYPE_DATA_FLASH.
 * @retval SSP_ERR_IN_USE           Flash is busy with an on-going operation.
 **********************************************************************************************************************/
static ssp_err_t setup_for_pe_mode (flash_lp_instance_ctrl_t * const p_ctrl, flash_type_t flash_type, flash_states_t flash_state)
{
    ssp_err_t err = SSP_SUCCESS;

    /** If the API is not ready return error. */
    if (g_flash_state != FLASH_STATE_READY)
    {
        err = SSP_ERR_IN_USE;
    }
    else
    {
        /** Lock the flash state. If failure return error. */
        if (SSP_SUCCESS != flash_lock_state(flash_state))
        {
            err = SSP_ERR_IN_USE;
        }
        else
        {
            /** Enter PE mode. If failure release software lock. */
            err = HW_FLASH_LP_pe_mode_enter(p_ctrl, flash_type);
            if (SSP_SUCCESS != err)
            {
                flash_ReleaseState();
            }
        }
    }

    /** Return status. */
    return err;
}

/*******************************************************************************************************************//**
 * @brief   This function will validate the supplied address, and return information about the block in which
 *          it resides.
 *
 * @param[in]   addr          Code or Data Flash address to return info for.
 * @param[out]  p_block_info  Pointer to a caller allocated flash_block_info_t structure which will be filled
 *                            in by this function.
 * @retval false    Supplied address is neither a valid Code or Data Flash address for this part.
 * @retval true     Supplied address is valid and p_block_infocontains the details on this addresses block
 **********************************************************************************************************************/
bool flash_get_block_info (uint32_t addr, flash_block_info_t * p_block_info)
{
    const flash_fmi_block_info_t * pBInfo = NULL;
    uint32_t                 num_sections = 0U;
    uint32_t                 bnum         = 0U;
    uint32_t                 num_tbl_entries = 0U;
    bool                     ret_value = false;

    p_block_info->total_blocks            = 0U;

