bluekitchen/btstack/port/renesas-tb-s1ja-cc256x/template/btstack_example/synergy/ssp/src/driver/r_flash_lp/r_flash_lp.c
    /** Loop over code flash regions */
    for (uint32_t i = 0U; i < g_flash_code_region.num_regions; i++)
    {
        /** If the address is within the code flash region save region information*/
        if ((addr >= g_flash_code_region.p_block_array[i].block_section_st_addr) &&
                (addr <= g_flash_code_region.p_block_array[i].block_section_end_addr))
        {
            p_block_info->is_code_flash_addr = true;
            p_block_info->flash_type = FLASH_TYPE_CODE_FLASH;
            num_tbl_entries                  = g_flash_code_region.num_regions;
            pBInfo                           = &g_flash_code_region.p_block_array[0];
        }
    }
    /** Loop over data flash regions */
    for (uint32_t i = 0U; i < g_flash_data_region.num_regions; i++)
    {
        /** If the address is within the data flash region save region information */
        if ((addr >= g_flash_data_region.p_block_array[i].block_section_st_addr) &&
                (addr <= g_flash_data_region.p_block_array[i].block_section_end_addr))
        {
            p_block_info->is_code_flash_addr = false;
            p_block_info->flash_type = FLASH_TYPE_DATA_FLASH;
            num_tbl_entries                  = g_flash_data_region.num_regions;
            pBInfo                           = &g_flash_data_region.p_block_array[0];
        }
    }

    /** Loop over all regions in the section of flash containing the address. */
    while (num_sections < num_tbl_entries)
    {
        ret_value = true;
        num_sections++;

        /** Calculate the number of blocks in the region */
        uint32_t num_blocks = (((pBInfo->block_section_end_addr + 1U) - pBInfo->block_section_st_addr) /
                pBInfo->block_size);

        /** If the address is within the region save detailed region information. */
        if ((addr >= pBInfo->block_section_st_addr)  && (addr <= pBInfo->block_section_end_addr))
        {
            bnum                                 = ((addr - pBInfo->block_section_st_addr) / pBInfo->block_size);

            p_block_info->this_block_st_addr     = pBInfo->block_section_st_addr + (bnum * pBInfo->block_size);
            p_block_info->this_block_end_addr    = (p_block_info->this_block_st_addr + pBInfo->block_size) - 1;
            p_block_info->this_block_number      = bnum + p_block_info->total_blocks;
            p_block_info->block_section_st_addr  = pBInfo->block_section_st_addr;
            p_block_info->block_section_end_addr = pBInfo->block_section_end_addr;
            p_block_info->block_size             = pBInfo->block_size;
            p_block_info->num_blocks             = num_blocks;
            p_block_info->min_program_size       = pBInfo->block_size_write;
        }

        /** Update the end of memory address and go to the next region. */
        p_block_info->memory_end_addr =   pBInfo->block_section_end_addr;
        pBInfo++;

        /** Increment the total block count by the number of blocks in the region. */
        p_block_info->total_blocks += num_blocks;
    }

    return ret_value;
}

/*******************************************************************************************************************//**
 * @brief   This function verifies that FCLK falls within the allowable range and calculates the timeout values
 *          based on the current FCLK frequency.
 *
 * @retval SSP_SUCCESS               Success
 * @retval SSP_ERR_FCLK              FCLK must be >= 4 MHz.
 * @retval SSP_ERR_INVALID_ARGUMENT  Invalid argument provided to CGC call. Should never occur...
 **********************************************************************************************************************/
static ssp_err_t flash_setup (flash_lp_instance_ctrl_t * const p_ctrl)
{
    ssp_err_t err;
    bsp_feature_flash_lp flash_lp_feature = {0U};

    /** Get BSP specific information about the flash LP. */
    /* We need clock frequencies to calculate the worst case timeout values. Note S124 and S128 do not have a
     *  separate FCLK, they use ICLK */
    R_BSP_FeatureFlashLpGet(&flash_lp_feature);

    /** Save the flash sp information to the global parameters structure. */
    g_current_parameters.flash_cf_macros = flash_lp_feature.flash_cf_macros;   // S3A7 and S3A1 have 2 CF macros. That's a special case for blank check.
    g_current_parameters.cf_macro_size = flash_lp_feature.cf_macro_size;
    g_current_parameters.cf_memory_st_addr = g_flash_code_region.p_block_array[0].block_section_st_addr;              // Starting memory address for Code Flash
    g_current_parameters.df_memory_st_addr = g_flash_data_region.p_block_array[0].block_section_st_addr;              // Starting memory address for Data Flash

    /** Get the frequency of the clock driving the flash. If failure return error. */
    err = g_cgc_on_cgc.systemClockFreqGet((cgc_system_clocks_t)flash_lp_feature.flash_clock_src, &g_current_parameters.flash_clock_freq);
    if (SSP_SUCCESS == err)
    {
        /** FCLK must be a minimum of 4 MHz for Flash operations. If not return error. */
        if (g_current_parameters.flash_clock_freq < MINIMUM_SUPPORTED_FCLK_FREQ)
        {
            err = SSP_ERR_FCLK;
        }
        else
        {
            /** Get the frequency of the system clock. If failure return error. */
            err = g_cgc_on_cgc.systemClockFreqGet(CGC_SYSTEM_CLOCKS_ICLK, &g_current_parameters.system_clock_freq);
        }
    }

    if (SSP_SUCCESS == err)
    {
        /** Initialize the flash timeout calculations and transfer global parameters to code and data flash layers. */
        HW_FLASH_LP_init(p_ctrl, &g_current_parameters);
        HW_FLASH_LP_code_flash_set_flash_settings(&g_current_parameters);      // Give HW layer below access to the configured settings
        HW_FLASH_LP_data_flash_set_flash_settings(&g_current_parameters);      // Give HW layer below access to the configured settings

        /** Enable the DataFlash */
        HW_FLASH_LP_dataflash_enable(p_ctrl);
    }

