bluekitchen/btstack/port/renesas-tb-s1ja-cc256x/template/btstack_example/synergy/ssp/src/driver/r_flash_lp/r_flash_lp.c
    return err;
}

/*******************************************************************************************************************//**
 * @brief   This function performs the parameter checking required by the R_FLASH_LP_Write() function.
 *
 * @retval SSP_SUCCESS               Parameter checking completed without error.
 * @retval SSP_ERR_INVALID_SIZE      Number of bytes provided was not a multiple of the programming size or exceeded
 *                                   the maximum range.
 * @retval SSP_ERR_NOT_OPEN          The Flash API is not Open.
 * @retval SSP_ERR_INVALID_ADDRESS   Invalid address was input or address not on programming boundary.
 **********************************************************************************************************************/
static ssp_err_t flash_write_parameter_checking (flash_lp_instance_ctrl_t * const p_ctrl, uint32_t flash_address, uint32_t const num_bytes)
{
    /** If null control block return error. */
    SSP_ASSERT(NULL != p_ctrl);
    volatile bool result1 = false;
    volatile bool result2 = false;
    volatile bool result3 = false;

    result1 = (bool)(flash_address >= g_block_info.block_section_st_addr);
    result2 = (bool)(flash_address <= g_block_info.block_section_end_addr);
    result3 = (bool)(!(flash_address & (g_block_info.min_program_size - 1U)));

    /** If invalid address return error. */
    FLASH_ERROR_RETURN((result1 && result2 && result3), SSP_ERR_INVALID_ADDRESS);

    result1 = (bool)(((num_bytes - 1U) + flash_address) > g_block_info.block_section_end_addr);
    result2 = (bool)((num_bytes & (g_block_info.min_program_size - 1U)));
    result3 = (bool)(0 == num_bytes);

    /** If invalid number of bytes return error. */
    FLASH_ERROR_RETURN(!(result1 || result2 || result3), SSP_ERR_INVALID_SIZE);

    return(SSP_SUCCESS);
}

/*******************************************************************************************************************//**
 * @brief   This function does the completion setup for the R_FLASH_HP_Open() function.
 *
 **********************************************************************************************************************/
static ssp_err_t flash_open_setup (flash_lp_instance_ctrl_t * const p_ctrl, ssp_feature_t *p_ssp)
{
    ssp_err_t err = SSP_SUCCESS;

    /** Release state so other operations can be performed. */
    flash_ReleaseState();

    /** Flash setup. */
    err = flash_setup(p_ctrl);    // Check FCLK, calculate timeout values

    /** If successful mark control block open otherwise release hardware lock and return error. */
    if (err != SSP_SUCCESS)
    {
        /* Return the hardware lock for the Flash */
        R_BSP_HardwareUnlock(p_ssp);
    }
    else
    {
        p_ctrl->opened = FLASH_OPEN;
    }

    return err;
}
/*******************************************************************************************************************//**
 * @brief   This function initiates the write sequence for the R_FLASH_LP_Write() function.
 *
 **********************************************************************************************************************/
static ssp_err_t flash_write_initiate (flash_lp_instance_ctrl_t * const p_ctrl, uint32_t const src_start_address, uint32_t dest_start_address, uint32_t num_bytes)
{
    ssp_err_t err;

    /** Set up PE mode */
    err = setup_for_pe_mode(p_ctrl, g_block_info.flash_type, FLASH_STATE_WRITING);

    /** If successful */
    if (SSP_SUCCESS == err)
    {
        /** Configure the current parameters for code flash or data flash depending on address. */
        if (g_block_info.is_code_flash_addr == true)
        {
            g_current_parameters.wait_cnt          = g_current_parameters.wait_max_write_cf;
            g_current_parameters.current_operation = FLASH_OPERATION_CF_WRITE;
            g_current_parameters.min_pgm_size      = (g_block_info.min_program_size >> 1);
        }
        else
        {
            g_current_parameters.wait_cnt = g_current_parameters.wait_max_write_df;
            g_current_parameters.min_pgm_size      = g_block_info.min_program_size;  // For MF3 DF it's always 1

            if (g_current_parameters.bgo_enabled_df == false)
            {
                g_current_parameters.current_operation = FLASH_OPERATION_DF_WRITE;
            }
            else
            {
                g_current_parameters.current_operation = FLASH_OPERATION_DF_BGO_WRITE;
            }
        }

        /** Write the data */
        err = HW_FLASH_LP_write(p_ctrl, src_start_address, dest_start_address, num_bytes, g_block_info.min_program_size);
        if (SSP_SUCCESS == err)
        {
            /** If in non-BGO mode, then current operation is completed. Exit PE mode and return status */
            if (g_current_parameters.current_operation != FLASH_OPERATION_DF_BGO_WRITE)
            {
                err = HW_FLASH_LP_pe_mode_exit(p_ctrl);
            }
        }
    }
    return(err);
}


/*******************************************************************************************************************//**
 * @brief   This function performs the final cleanup for the erase, write and blankcheck functions. Executes a reset
 *          if any error has been indicated. Releases the state if the current operation is NOT BGO.
 *
 **********************************************************************************************************************/
static void flash_operation_complete (flash_lp_instance_ctrl_t * const p_ctrl, ssp_err_t err)
{
    /** SSP_ERR_IN_USE will be returned if we are in the process of executing a BGO operation. In this case we do
     * not want to take any action as that will terminate the in process operation */
    if ((g_current_parameters.bgo_enabled_df == true) &&
        ((g_current_parameters.current_operation == FLASH_OPERATION_DF_BGO_ERASE) ||
         (g_current_parameters.current_operation == FLASH_OPERATION_DF_BGO_WRITE) ||
         (g_current_parameters.current_operation == FLASH_OPERATION_DF_BGO_BLANKCHECK)))
    {
        if ((err == SSP_ERR_IN_USE) || (err == SSP_SUCCESS))
        {
            return;
        }
    }
    else
    {
        /** We are not in a BGO mode, so this operation is complete. Release the software lock. */
        flash_ReleaseState();

        /** If failure reset the flash. */
        if (err != SSP_SUCCESS)
        {
            HW_FLASH_LP_reset(p_ctrl);
        }
    }
}

#if (FLASH_CFG_PARAM_CHECKING_ENABLE == 1)
/*******************************************************************************************************************//**
 * @brief   This function performs the parameter checking required by the R_FLASH_HP_Erase() function.
 *
 * @retval SSP_SUCCESS               Parameter checking completed without error.
 * @retval SSP_ERR_INVALID_BLOCKS    Invalid number of blocks specified
 * @retval SSP_ERR_NOT_OPEN          The Flash API is not Open.
 * @retval SSP_ERR_INVALID_ARGUMENT  Code Flash Programming is not enabled and a request to erase CF was requested.
 **********************************************************************************************************************/
static ssp_err_t flash_erase_parameter_checking (flash_lp_instance_ctrl_t * const p_ctrl, uint32_t const num_blocks)
{
    /** If null pointer return error. */
    SSP_ASSERT(NULL != p_ctrl);
    volatile bool result1 = false;
    volatile bool result2 = false;
    volatile bool result3 = false;

    /** If invalid number of blocks return error. */
    result1 = (bool)(num_blocks > g_block_info.total_blocks);
    result2 = (bool)(num_blocks > (g_block_info.total_blocks - g_block_info.this_block_number));
    result3 = (bool)(num_blocks <= 0U);

