bluekitchen/btstack/port/renesas-tb-s1ja-cc256x/template/btstack_example/synergy/ssp/src/driver/r_flash_lp/r_flash_lp.c
    FLASH_ERROR_RETURN(!(result1 || result2 || result3), SSP_ERR_INVALID_BLOCKS);

    /** If not open return error */
    FLASH_ERROR_RETURN((FLASH_OPEN == p_ctrl->opened), SSP_ERR_NOT_OPEN);

    /** If Code Flash Programming is not enabled, then the requisite functions are NOT in RAM and we can not allow an Erase request for
     * Code Flash */
#if (FLASH_CFG_PARAM_CODE_FLASH_PROGRAMMING_ENABLE == 0)
    FLASH_ERROR_RETURN((g_block_info.is_code_flash_addr == false), SSP_ERR_INVALID_ARGUMENT);
#endif

    return(SSP_SUCCESS);
}
#endif
/*******************************************************************************************************************//**
 * @brief   This function performs the parameter checking required by the R_FLASH_HP_BlankCheck() function.
 *
 * @retval SSP_SUCCESS               Parameter checking completed without error.
 * @retval SSP_ERR_INVALID_BLOCKS    Invalid number of blocks specified
 * @retval SSP_ERR_NOT_OPEN          The Flash API is not Open.
 * @retval SSP_ERR_IN_USE            The Flash peripheral is busy with a prior on-going transaction.
 **********************************************************************************************************************/
static ssp_err_t flash_blank_check_parameter_checking (flash_lp_instance_ctrl_t * const p_ctrl, uint32_t const address, uint32_t num_bytes)
{
    ssp_err_t err = SSP_SUCCESS;

    SSP_ASSERT(NULL != p_ctrl);

    /** If not open return error. */
    FLASH_ERROR_RETURN((FLASH_OPEN == p_ctrl->opened), SSP_ERR_NOT_OPEN);

    /** If invalid address or bytes return error. */
    err = flash_blank_check_address_checking (address, num_bytes);
    FLASH_ERROR_RETURN((err == SSP_SUCCESS), err);

    /* If the flash is not in the ready state return error. */
    FLASH_ERROR_RETURN((g_flash_state == FLASH_STATE_READY), SSP_ERR_IN_USE);

    return(err);
}

/*******************************************************************************************************************//**
 * @brief   This function performs the address checking required by the R_FLASH_HP_BlankCheck() function.
 *
 * @retval SSP_SUCCESS               Parameter checking completed without error.
 * @retval SSP_ERR_INVALID_ADDRESS   Invalid data flash address was input.
 * @retval SSP_ERR_INVALID_SIZE      'num_bytes' was either too large or not aligned for the CF/DF boundary size.
 **********************************************************************************************************************/
static ssp_err_t flash_blank_check_address_checking (uint32_t const address, uint32_t num_bytes)
{
    ssp_err_t err = SSP_SUCCESS;
    volatile bool result1 = false;
    volatile bool result2 = false;

    result1 = (bool)(address >= g_block_info.block_section_st_addr);
    result2 = (bool)(address <= g_block_info.block_section_end_addr);
    FLASH_ERROR_RETURN((result1 && result2), SSP_ERR_INVALID_ADDRESS);


    result1 = (bool)((num_bytes + address) > (g_block_info.block_section_end_addr + 1U));
    result2 = (bool)(0 == num_bytes);

    FLASH_ERROR_RETURN(!(result1 || result2), SSP_ERR_INVALID_SIZE);


    /** Is this a request to Blank Check Data Flash?.  If so, num_bytes must be a multiple of the programming size */
    if (g_block_info.is_code_flash_addr == false)
    {
        FLASH_ERROR_RETURN(!(num_bytes & (g_block_info.min_program_size - 1U)), SSP_ERR_INVALID_SIZE);
    }

    return(err);
}



/*******************************************************************************************************************//**
 * @brief   This function performs the Blank check phase required by the R_FLASH_HP_BlankCheck() function.
 *
 * @retval SSP_SUCCESS           Setup completed completed without error.
 * @retval SSP_ERR_PE_FAILURE    Failed to enter P/E mode
 **********************************************************************************************************************/

static ssp_err_t flash_blank_check_initiate ( flash_lp_instance_ctrl_t * const p_ctrl, uint32_t const address, uint32_t num_bytes, flash_result_t *p_blank_check_result)
{
    ssp_err_t err = SSP_SUCCESS;

    /** Configure the current operation and wait count based on the number of bytes and if it's a data flash or code flash operation. */
    /* Is this a request to Blank check Code Flash? */
    if (g_block_info.is_code_flash_addr == true)
    {
        /* This is a request to Blank check Code Flash */
        /*No errors in parameters. Enter Code Flash PE mode*/
        /* wait_max_blank_check specifies the wait time for a 4 ROM byte blank check.
         * num_bytes is divided by 4 and then multiplied to calculate the wait time for the entire operation */
        if (num_bytes < (uint32_t)4)
        {
            g_current_parameters.wait_cnt = g_current_parameters.wait_max_blank_check * num_bytes;
        }
        else
        {
            g_current_parameters.wait_cnt = (g_current_parameters.wait_max_blank_check * (num_bytes >> 2));
        }
        g_current_parameters.current_operation = FLASH_OPERATION_CF_BLANKCHECK;
    }
    else
    {
        /* This is a request to Blank check Data Flash */
        /* No errors in parameters. Enter Data Flash PE mode*/
        /* wait_max_blank_check specifies the wait time for a 4 ROM byte blank check. This is the same as the
         * wait time for a 1 byte Data Flash blankcheck.*/
        g_current_parameters.wait_cnt = g_current_parameters.wait_max_blank_check * num_bytes;
        if (g_current_parameters.bgo_enabled_df == false)
        {
            g_current_parameters.current_operation = FLASH_OPERATION_DF_BLANKCHECK;
        }
        else
        {
            g_current_parameters.current_operation = FLASH_OPERATION_DF_BGO_BLANKCHECK;
        }
    }

    /** Start the Blank check operation. */
    /* If BGO is enabled then the result of the Blank check will be
     * available when the interrupt occurs and p_blank_check_result will contain FLASH_RESULT_BGO_ACTIVE */
    err = HW_FLASH_LP_blankcheck(p_ctrl, address, num_bytes, p_blank_check_result);

    if (SSP_SUCCESS == err)
    {
        /** If in non-BGO mode, then current operation is complete. Exit PE mode and return status */
        if (g_current_parameters.current_operation != FLASH_OPERATION_DF_BGO_BLANKCHECK)
        {
            err = HW_FLASH_LP_pe_mode_exit(p_ctrl);
            g_current_parameters.current_operation = FLASH_OPERATION_IDLE;
        }
    }
    return(err);
}

/*******************************************************************************************************************//**
 * @brief   This function initializes data required by the Flash based on information read from the FMI.
 *
 * @retval SSP_SUCCESS               FMI based setup success.
 * @retval SSP_ERR_IN_USE            The Flash peripheral is busy with a prior on-going transaction.
 * @retval SSP_ERR_ASSERTION         Problem getting FMI information.
 * @retval SSP_ERR_HW_LOCKED         Unable to get the HW lock for the Flash.
 *
 **********************************************************************************************************************/
static ssp_err_t flash_fmi_setup (flash_lp_instance_ctrl_t * const p_ctrl, flash_cfg_t const * const p_cfg, ssp_feature_t *p_ssp)
{
    ssp_err_t err = SSP_SUCCESS;

    p_ssp->id = SSP_IP_CFLASH;
    p_ssp->channel = 0U;
    p_ssp->unit = 0U;
    fmi_feature_info_t info = {0};

    /** Initialize the code flash region data. */
    g_fmi_on_fmi.productFeatureGet(p_ssp, &info);
    g_flash_code_region.num_regions = info.channel_count;
    g_flash_code_region.p_block_array = (flash_fmi_block_info_t const *) info.ptr_extended_data;

    /** Initialize the data flash region data. */
    p_ssp->id = SSP_IP_DFLASH;
    g_fmi_on_fmi.productFeatureGet(p_ssp, &info);
    g_flash_data_region.num_regions = info.channel_count;
    g_flash_data_region.p_block_array = (flash_fmi_block_info_t const *) info.ptr_extended_data;

    p_ssp->id = SSP_IP_FCU;
    err = g_fmi_on_fmi.productFeatureGet(p_ssp, &info);
    FLASH_ERROR_RETURN(SSP_SUCCESS == err, err);

    p_ctrl->p_reg = (R_FACI_Type *) info.ptr;

    /** Initialize event information. */
    ssp_vector_info_t * p_vector_info;
    fmi_event_info_t event_info = {(IRQn_Type) 0};
    g_fmi_on_fmi.eventInfoGet(p_ssp, SSP_SIGNAL_FCU_FRDYI, &event_info);
    p_ctrl->irq = event_info.irq;
    if (SSP_INVALID_VECTOR != p_ctrl->irq)
    {
        R_SSP_VectorInfoGet(p_ctrl->irq, &p_vector_info);
        NVIC_SetPriority(p_ctrl->irq, p_cfg->irq_ipl);
        *(p_vector_info->pp_ctrl) = p_ctrl;
    }

    /** Take the hardware lock for the Flash. If failure return error. */
    FLASH_ERROR_RETURN(!(SSP_SUCCESS != R_BSP_HardwareLock(p_ssp)), SSP_ERR_HW_LOCKED);
    return(SSP_SUCCESS);
}


